{"/aboutme/":{"data":{"":"High-energy mechanical engineer with nine years of progressive experience in design and manufacturing environments. Seeking opportunities to solve diﬃcult problems through machine design and process improvement. Located in Richmond, VA.\nContact:\nEmail: ethan.kingsley@gmail.com\nLinkedIn: My Profile","corps-member---american-conservation-experience-americorps-program-2018#Corps. Member - American Conservation Experience (Americorps Program) (2018)":"American Conservation Experience (ACE) is a non-profit organization dedicated to providing rewarding environmental service opportunities that harness the idealism and energy of a volunteer labor force to help restore America’s public lands.\nVolunteer member for six months. Focused on trail maintenance and repair, forest fire prevention, and ecological restoration.","design-engineer---taktl-llc-2016-2018#Design Engineer - TAKTL LLC (2016-2018)":"TAKTL, LLC is the leading provider of Architectural Ultra High-Performance Concrete cladding panels, integrating UHPC formulation, mold design, and automated manufacturing to produce architectural elements.\nDesign Engineer responsible for the design, improvement and repair of manufacturing and R\u0026D machinery and identifying and implementing manufacturing process improvements.","education#Education":"University of Pittsburgh - Bachelors of Science in Mechanical Engineering (2011-2015)","mechanical-engineer---bddw-studio-llc-2018-2019#Mechanical Engineer - BDDW Studio LLC (2018-2019)":"BDDW is an American design and fabrication company dedicated to design, expert craftsmanship and advanced manufacturing practices.\nHead Manufacturing Engineer responsible for installation, maintenance, repair, and improvement of machinery used in the development and manufacturing of bespoke and custom furniture.","mechanical-engineer-iii---trek-bicycle-company-2019-current#Mechanical Engineer III - Trek Bicycle Company (2019-Current)":"Trek Bicycle is a global leader in the design and manufacture of bicycles and related products.\nMechanical Engineer responsible for test process improvement and all stages of the design, assembly, and commissioning of test equipment utilized in R\u0026D and production environments.\nIndependently led creation and completion of five novel machine designs and automation improvements totaling hundreds of thousands of dollars in capital expenditure Interpreted dozens of standards and ensured all machine designs met testing requirements of the standards Introduced and managed Standard Operating Procedures and checklists for mechanical and electrical design and documentation Operate within a PLM environment managing a CAD library of vendor-supplied and internally-designed components Created design requirements from functional requirements and translate those requirements into mechanical parts and complete machine assemblies utilizing parametric CAD Perform DFMA for machining, sheet metal processes, welding, and 3D printing, balancing design requirements with cost Participate in design reviews and work with engineers of other disciplines to ensure functionality between all machine subsystems Acted as a trusted technical resource and mentor in the areas of mechanical design, process design, testing, and standard interpretation and implementation for a wide variety of internal and external customers.","product-support-engineer---aerotech-2015-2016#Product Support Engineer - Aerotech (2015-2016)":"Aerotech designs and manufactures the highest performance motion control, positioning tables/stages, and positioning systems for customers in industry, government, science, and research institutions around the world.\nProduct Support Engineer responsible for repairing, troubleshooting, and improving precision motion control systems made up of software, electrical components, and mechanical components.","professional-experience#Professional Experience":""},"title":"About Me"},"/portfolio/":{"data":{"":"This portfolio is a showcase of a variety of skills, focused specifically on [[Automated Machine Design]] but also [[Electrical Design]], [[Programming]], and [[Operations Improvement]]. This is a collection of projects from my most recent position as Mechanical Engineer III at Trek Bicycle Company.\nProjects can be viewed dynamically grouped by area of interest by using the below links:\nMechanical Design Mechanical Drawings Engineering Calculations Electrical Design Programming Writing Samples Or items can be grouped by skill\n3D CAD Python Jira anything and everything, dynamically generated Otherwise projects may be viewed chronologically using the toolbar at the left.\nThe intention is that some recruiter could quickly look at all of the examples of some skill on one page\nI’m thinking we could accomplish this by creating tags for every paragraph of content and then filtering all of the content by those tags on different pages, which is more like something obsidian can do."},"title":"Portfolio"},"/portfolio/01-fpl2025/":{"data":{"":"","project-background#Project Background":"Every carbon fiber bicycle fork made by Trek undergoes a test known as the Fork Proof Load Test, where the fork is held at a standard load for 60 seconds, and the permanent deflection of the fork is measured. Forks with a permanent deflection above a certain value must be scrapped. The overall rate of scrapped forks is extremely low.\nThere were multiple factors at play that led to this project:\nDue to learnings from the Fork Proof Load Data Analysis there was a desire to reprogram the control system to have a more robust data capture, storage, and upload system. Although the electrical redesign accomplished during Fork Proof Load Electrical Redesign (2023-2024) was a major improvement over Fork Proof Load Mechanical Redesign (2021), and achieved the goals of the project within the constraints of the project (i.e. utilizing the existing Horner Control System and LabVIEW PC program) ,the end result was electrically complicated. A simpler electrical design was needed for ease of assembly and future maintenance efforts. The recent decision to move to Beckhoff as our control system platform showed there were new opportunities that came from that system that would alleviate many issues within the FPL control system design A new supplier factory was opening which required a solution quickly The machine needed to be assembled quickly, but also needed upgrades to the control system because we did not want to risk any more data errors with any more machines due to their importance. The decision was made to refurbish an existing prototype of the FPL machine and retrofit a new control system onto the framework.\nThe system involved an #electrical redesign, #mechanical-cad, #mechanical-drawings, and more."},"title":"Fork Proof Load Control System Redesign (2025)"}}