{"/aboutme/":{"data":{"":"High-energy mechanical engineer with nine years of progressive experience in design and manufacturing environments. Seeking opportunities to solve diﬃcult problems through machine design and process improvement. Located in Richmond, VA.\nContact:\nEmail: ethan.kingsley@gmail.com\nLinkedIn: My Profile","corps-member---american-conservation-experience-americorps-program-2018#Corps. Member - American Conservation Experience (Americorps Program) (2018)":"American Conservation Experience (ACE) is a non-profit organization dedicated to providing rewarding environmental service opportunities that harness the idealism and energy of a volunteer labor force to help restore America’s public lands.\nVolunteer member for six months. Focused on trail maintenance and repair, forest fire prevention, and ecological restoration.","design-engineer---taktl-llc-2016-2018#Design Engineer - TAKTL LLC (2016-2018)":"TAKTL, LLC is the leading provider of Architectural Ultra High-Performance Concrete cladding panels, integrating UHPC formulation, mold design, and automated manufacturing to produce architectural elements.\nDesign Engineer responsible for the design, improvement and repair of manufacturing and R\u0026D machinery and identifying and implementing manufacturing process improvements.","education#Education":"University of Pittsburgh - Bachelors of Science in Mechanical Engineering (2011-2015)","mechanical-engineer---bddw-studio-llc-2018-2019#Mechanical Engineer - BDDW Studio LLC (2018-2019)":"BDDW is an American design and fabrication company dedicated to design, expert craftsmanship and advanced manufacturing practices.\nHead Manufacturing Engineer responsible for installation, maintenance, repair, and improvement of machinery used in the development and manufacturing of bespoke and custom furniture.","mechanical-engineer-iii---trek-bicycle-company-2019-current#Mechanical Engineer III - Trek Bicycle Company (2019-Current)":"Trek Bicycle is a global leader in the design and manufacture of bicycles and related products.\nMechanical Engineer responsible for test process improvement and all stages of the design, assembly, and commissioning of test equipment utilized in R\u0026D and production environments.\nIndependently led creation and completion of five novel machine designs and automation improvements totaling hundreds of thousands of dollars in capital expenditure Interpreted dozens of standards and ensured all machine designs met testing requirements of the standards Introduced and managed Standard Operating Procedures and checklists for mechanical and electrical design and documentation Operate within a PLM environment managing a CAD library of vendor-supplied and internally-designed components Created design requirements from functional requirements and translate those requirements into mechanical parts and complete machine assemblies utilizing parametric CAD Perform DFMA for machining, sheet metal processes, welding, and 3D printing, balancing design requirements with cost Participate in design reviews and work with engineers of other disciplines to ensure functionality between all machine subsystems Acted as a trusted technical resource and mentor in the areas of mechanical design, process design, testing, and standard interpretation and implementation for a wide variety of internal and external customers.","product-support-engineer---aerotech-2015-2016#Product Support Engineer - Aerotech (2015-2016)":"Aerotech designs and manufactures the highest performance motion control, positioning tables/stages, and positioning systems for customers in industry, government, science, and research institutions around the world.\nProduct Support Engineer responsible for repairing, troubleshooting, and improving precision motion control systems made up of software, electrical components, and mechanical components.","professional-experience#Professional Experience":""},"title":"About Me"},"/portfolio/":{"data":{"":"This portfolio is a showcase of a variety of skills, focused specifically on [[Automated Machine Design]] but also [[Electrical Design]], [[Programming]], and [[Operations Improvement]]. This is a collection of projects from my most recent position as Mechanical Engineer III at Trek Bicycle Company.\nProjects can be viewed dynamically grouped by area of interest by using the below links:\nMechanical Design Mechanical Drawings Engineering Calculations Electrical Design Programming Writing Samples Or items can be grouped by skill\n3D CAD Python Jira anything and everything, dynamically generated Otherwise projects may be viewed chronologically using the toolbar at the left.\nThe intention is that some recruiter could quickly look at all of the examples of some skill on one page\nI’m thinking we could accomplish this by creating tags for every paragraph of content and then filtering all of the content by those tags on different pages, which is more like something obsidian can do.\nA note on CAD images. There is some inconsistency throughout the images- some are rendered and some are in Onshape."},"title":"Portfolio"},"/portfolio/01-fpl2025/01-fpl2025/":{"data":{"":"Project Background There were multiple factors at play that led to this project:\nDue to learnings from the Fork Proof Load Data Analysis there was a desire to reprogram the control system to have a more robust data capture, storage, and upload system. Although the electrical redesign accomplished during Fork Proof Load Electrical Redesign (2023-2024) was a major improvement over Fork Proof Load Mechanical Redesign (2021), and achieved the goals of the project within the constraints of the project (i.e. utilizing the existing Horner Control System and LabVIEW PC program), the end result was electrically complicated. A simpler electrical design was needed for ease of assembly and future maintenance efforts. The recent decision to move to Beckhoff as our control system platform showed there were new opportunities that came from that system that would alleviate many issues within the FPL control system design A new supplier factory was opening which required a solution quickly The machine needed to be assembled quickly, but also needed upgrades to the control system because we did not want to risk any more data errors with any more machines due to their importance. The decision was made to refurbish an existing prototype of the FPL machine and retrofit a new control system onto the framework.\nI was the project lead and responsible for project management, mechanical component design, mechanical assembly design, control system design, and electrical design.\nProject Features","control-system-redesign#Control System Redesign":"The control system was completely migrated from Horner and LabVIEW to Beckhoff. It was programmed in IEC 61131-3 Stuctured Text with additional modules from Beckhoff libraries. The project was version managed with git. The control system controlled a Festo CPX unit over EtherCAT, communicated with displacement transducers via IO Link, controlled Zebra Barcode Scanners via TCP/IP, and communicated with tulip.co to query and upload data via a HTTPS REST API.","electrical-system-redesign#Electrical System Redesign":"The electrical system was vastly simplified from the 2023 design. Moving to a modern control system allowed us to take advantage of fieldbus IO boxes, and since we were using Beckhoff we used EtherCAT field IO boxes. Digital IO, analog IO, and IO Link were utilized in the project. The HMI was simplified to a single screen which can smoothly scale from 1-4 stations depending on the machine configuration. All sensors connect directly to a field IO box, with a single cable which travels back to the control panel via the EtherCAT P standard.","framework-retrofit--refurbishment#Framework Retrofit / Refurbishment":"The weldment framework that was used in the project did not have any 3D CAD or 2D drawings. The frame had to be reverse engineered and recreated in Onshape. The framework was modified as well and painted. Existing clamp subassembly components needed to be modified and new mechanical drawings were created indicating the required modifications. New sheet metal parts were designed to create safety guarding as well as mounting points for control system pneumatic components.","integration-with-existing-tulip-powered-database#Integration with Existing Tulip-powered Database":"Because we were already using tulip.co for the Test Database and Applications (2021-2023) project we decided to create a database of fork proof load data in Tulip as well. A new database within Tulip was designed for Fork Proof Load data, and the REST API was chosen as the communication method, although MQTT and OPC UA were considered as well.","pneumatic-circuit-redesign#Pneumatic Circuit Redesign":"The pneumatic circuitry in FPL2023 involved 5 separate pneumatic valves for each station, four to control the load cylinder and one 5/3 valve to control the clamp cylinder. Working with a supplier of Festo systems a single CPX/MPA Festo valve assembly was specified with a single VPPM pressure control valve, a 5/3 valve to control air into the VPPM and expansion of the load cylinder, and a 5/3 valve to control the clamp cylinder. The CPX was specified with EtherCAT to again simplify the electrical design requirements.","project-background#Project Background":"","project-features#Project Features":""},"title":"Fork Proof Load Control System Redesign (2025)"},"/portfolio/02-lateralracktester2025/02-lateralracktester2025/":{"data":{"":"Project Background Every bicycle rack sold by Trek must adhere to the ISO 11243 test standard, which dictates a suite of static and fatigue tests with both vertical and horizontal forces in reference to the standard mounting position of the rack on the bicycle.\nThis project was replacing an existing lateral fatigue test machine which had some limitations and elements of its design that needed to be redesigned.\nThe enclosure of the machine was too small to allow modern larger e-bikes and cargo bikes The mechanism of the oscillation induced many extra oscillations and caused direction change too quickly, imparting extra load on the racks and in some cases prematurely failed bolts utilized Summary / Description of the Machine Image of CAD GIF of motion The final deliverable of the machine was a machine frame built out of AngleLock [[Lateral Rack Tester (2025)#First implementation of AngleLock]], a Beckhoff control system, with safety off switches and E-Stops. The machine could oscillate (x kg) at (x millimeters above the axis of rotation) at 1 Hz with an arc of +/- 10 degrees or +/-15 degrees. A counterbalance was utilized to assist the servo motor and smooth out machine. The height of the counterbalance from the axis of rotation was fixed but the mass could be adjusted using readily-available strength training barbell plates. The low mass accuracy of the barbell plates was not an issue for this application.\nFixtures were created to accommodate a wide range of bicycle frames, rear bicycle racks by themselves, front bicycle racks by themselves, and headtube mounted front bicycle racks by themselves.\nAs of this writing the machine has gone through tens of millions of cycles and tested dozens of different test samples.\nProject Features","calculation-of-torque-requirements-inertia-counterbalance-and-working-with-beckhoff-to-get-the-correct-gearbox-and-servo#Calculation of torque requirements, inertia, counterbalance, and working with Beckhoff to get the correct gearbox and servo":"Although the majority of the time the machine would only be handling standard bicycles and rack loads an additional requirement of the machine was to be able to handle cargo bikes at their maximum weight carrying capacity. This significantly increased the size of the components required. The torque requirement was calculated by…","fea-and-fatigue-analysis-for-shaft-selection#FEA and fatigue analysis for shaft selection":"Due to the high number of cycles for a standard test and due to the fully reversing nature of the test, a fatigue analysis was required for the shaft. FEA in Onshape was utilized to calculate the principal(?) or Von Mises (?) stresses. These values were then used in (some formula) to determine the (something). The general rule of thumb of steels having a fatigue strength around half of their Ultimate strength was utilized to confirm we had a factor of safety of x. A shaft made of Steel (some alloy).","first-implementation-of-anglelock#First implementation of AngleLock":"After discovering AngleLock [[Operations#Selection of New Vendors]]and determining they would be worth trying with fixturing or on a new machine, I decided to go forward with utilizing AngleLock for the entire machine. I consulted with AngleLock on the expected hold-force rating of a variety of their fasteners and designed the machine around the requirements.\nThis was a success. The lead times were short for all components. The adjustable assembly has been very beneficial. The AngleLock system allows new fixturing to be designed and manufactured quickly, usually out of laser cut sheet metal parts.","first-implementation-of-gates-timing-belt-and-selection-of-components#First implementation of Gates Timing belt, and selection of components":"At the beginning of the project, several mechanism options were considered between traditional mechanisms that convert rotational motion into oscillation, or a rotational or linear servo or stepper in combination with a gearbox and gearing or a timing belt could be used. After all of the options were considered it was decided that a timing belt would be the best path forward (for reasons). After consulting the Gates Design Manual (link?) a Power Grip GT4 belt was selected and the subsequent calculations performed to select the components required.","first-implementation-of-the-beckhoff-control-system#First implementation of the Beckhoff control system":"After the Test Department decided to move forward with the adoption of [[Operations#Selection of Beckhoff Control System]] the Lateral Rack Tester was the first machine that we developed with Beckhoff.\nThe machine utilized Beckhoff rotary servo motors, EtherCAT field boxes (EP series), and an integrated HMI/controller. The utilization of field boxes allowed the control panel to be placed anywhere, with only a single servo motor/encoder cable and EtherCAT cable going back to the control box, with all other sensor wires not extending beyond the machine itself. Safety toggle switches and E-Stops were implemented. The control system was written in Structured Text in TwinCAT3 version 4024.","many-some-number-adjustable-fixtures-to-accomodate-a-wide-range-of-rack-types#Many (some number?) adjustable fixtures to accomodate a wide range of rack types":"","project-background#Project Background":"","project-features#Project Features":"","requirements-of-the-child-carrier#Requirements of the child carrier":"The first test sample to go on the machine was a bicycle frame with an integrated rack that allowed the mounting of third-party child carriers. The child carrier standard was a new standard that had not been tested before in the lab and the mass of the child carrier was placed a further distance from the axis of rotation than any other test sample. Because the radius value of intertia is squared, any distance from the axis of rotation has a large influence on the total system inertia. This was another design requirement of the machine The test standard required custom made bags of sand to be used. I located a vendor who could create custom bags out of cordura and fill them with sand to the required mass specification. I created the drawings for the “legs” and “body” of the child as required by the standard.","summary--description-of-the-machine#Summary / Description of the Machine":"","usage-and-calculation-of-fenner-keyless-bushings#Usage and calculation of Fenner keyless bushings":"In our effort to reduce the number of machined parts required to keep lead times low, we wanted to be able to purchase a COTS shaft with constant diameter. This presents problems with how to locate parts along the shaft, especially in this machine where some parts are pillow block bearings allowing rotation of the shaft, but other parts must be coupled to teh shaft, and the motion of the shaft is continuously reversing. Additionally, the required length of the test platform also required a long shaft so that the load could be evenly distributed along the shaft. A COTS shaft that was long enough could be obtained with keyways at the ends but not along the entire length. Designing splines or other machined features was avoided due to the aforementioned lead time concerns. I located Fenner Keyless Bushings (link?) and did some preliminary calculations to see if they would work. This was also a contributing factor in determining our final shaft size. I performed the final calculations and consulted with the engineering staff at Fenner to verify that the fully reversing conditions of my application would not be a problem, or would not require an additional compensating factor in the calculations for the torque ratings of the bushings. I utilized the design guidelines from Fenner to design the bushing carriers (Image of carriers) After tens of millions of cycles the drives have not slipped from their installed position."},"title":"Lateral Rack Tester (2025)"},"/portfolio/04-fpl2023/04-fpl2023/":{"data":{"":"Project Background A background on the Fork Proof Load test requirements as described in ISO 4210 can be seen on the Fork Proof Load 2021 Mechanical Redesign page. In 2023 two customers ordered Fork Proof Load machines. One needed four test stations and the other needed two test stations. After two years in service, the 2021 design was exhibiting some electrical issues and troubleshooting was difficult. As the project lead I decided an electrical redesign should be performed to create a modular mechanical and electrical design to allow for a configurable 1-4 station machine and eliminate the electrical issues plaguing the 2021 design. I was the project lead and responsible for the project management, mechanical component design, mechanical assembly design, and electrical design.\nFinal Deliverable and Successes Two Fork Proof Load machines, one with 2 stations and the other with 4 stations were delivered in Q1 2024, roughly 10 months after the project began. Shortly after delivery I visited the installation sites and performed Factory Acceptance Testing (FAT). Both machines have been in service for over a year and a half without a single issue leading to downtime.\nThe largest configuration of the machine utilizes 8 pneumatic cylinders, 20 pneumatic valves, an air pressure sensor, 4 load cells, 4 displacement transducers, 4 barcode scanners, 5 PLCs, and is compliant with the ISO 4210 standard for testing. The machine transfers data from the PLCs to a LabVIEW program pulling data from the CAN bus and uploading the data to an Azure server via FTP.\nProject Features","electrical-redesign#Electrical Redesign":"The project required nearly a 100% redesign of the electrical system and layout compared to the 2021 version. A comprehensive redesigned was performed involving up to 4 HMI control panels, 1 main control panel, dozens of new connectors, power supplies and all other necessary electrical components for safety and functionality.\nA modular approach was taken which allows the machine to be specified with 1 to 4 stations depending on the customer needs. An advanced multivariable configuration across multiple parts and assemblies was created in Onshape allowing instant selection of configuration and automatic BOM and mechanical drawing creation for main control panel and its gland plates.\nUp to 4 independent HMIs utilizing Horner XL4 controllers were linked via CAN to each other and back to a PC running a LabVIEW program to communicate to an Azure server via FTP. Each pneumatic cylinder responsible for applying the test load utilized a load cell and displacement transducer to measure load and fork flexure during the test. Each station consisted of five pneumatic valves. Each station also had a barcode scanner utilizing RS232. All control signals for sensors, relays, and all other IO were routed back to the main control panel, then to the HMI PLCs via 24 pin connectors.\nMany lessons were learned during this project. The 2025 design of the machine aggressively simplified the electrical design of the machine while retaining the modular functionality.\nThe delivered wiring diagrams and assembly instructions can be seen below.","final-deliverable-and-successes#Final Deliverable and Successes":"","large-bill-of-materials#Large Bill of Materials":"The total assembly involved a bill of materials of over 1000 items. Each of these items had an equivalent in CAD with all properties attached to the file such as supplier, material, mass, and more. All purchases and shipments were tracked in Atlassian Jira and Microsoft Excel. A new vendor CAD library structure was created to handle the electrical components- previously these were not tracked in 3D CAD by the Test Department.","mechanical-design-changes#Mechanical Design Changes":"Building off of the 2021 version of the machine there were numerous mechanical design changes to accommodate the addition of auxiliary control panels, a main control panel, and guarding for external cable routing. The previous design was migrated from SolidWorks to Onshape. The mechanical drawings had to be replaced for all parts due to small and large changes. Additionally stiffness issues in the frame were seen before shipment of the 2021 version, which required the addition of additional bracing before shipment. New 3\"x3\" tubing was added to increase the stiffness of the frame in the direction of the applied load. Welded assemblies were designed, many laser cut and bent sheet metal parts were designed, numerous machined parts were designed from 1040, 4140 and A2 steels as well as 304 stainless steel. Design For Manufacture and Assembly (DFMA) was deeply considered for each part.","mechanical-drawings#Mechanical Drawings":"Over 50 pages of mechanical drawings were produced for the machine. A broad sampling can be seen below. A full tolerance stack-up was performed for all weldments and mechanical subassemblies leading to seamless assembly and reduced fabrication and machining costs.\nA few higher resolution drawings can be inspected here: Weldment Detail 1 Weldment Detail 2 Weldment Detail 3 Part Detail 1 Part Detail 2 Part Detail 3","new-vendors#New Vendors":"All machine shops and fabricators in the state of Wisconsin were evaluated on a variety of factors such as machining and fabrication abilities, post processing abilities (paint, heat treatment, etc.), perceived organization and more. 15 vendors were selected from this list to be contacted. 7 confirmed they would work on low quantity prototype runs such as the Test Department’s machines. These all supplied quotes for the frame weldment and machined components. The best price, shortest lead time, and quality of relationship were then used to select the overall vendor for the project.","project-background#Project Background":"","project-features#Project Features":""},"title":"Fork Proof Load Electrical Redesign (2023-2024)"},"/portfolio/06-verticalracktester2022/06-verticalracktester2022/":{"data":{"":"Image of the CAD\nProject Background This was a bluesky machine design project with the following requirements\nFollow ISO 11243 Vertical Fatigue Test Oscillate the test sample at 7 Hz within some vertical range of motion The machine must be able to oscillate some number of kgs The previous machine had an issue with pinchpoints, so the safety must be improved Final Deliverable The machine worked\nProject Features","3d-cad#3D CAD":"","ac-motor-sizing#AC Motor Sizing":"","final-deliverable#Final Deliverable":"","mechanical-drawings#Mechanical Drawings":"","oscillation-mechanism-design#Oscillation Mechanism Design":"","project-background#Project Background":"","project-features#Project Features":"","v-belt-pulley-design#V Belt Pulley Design":""},"title":"Vertical Rack Tester (2022)"},"/portfolio/07-fpl2021/07-fpl2021/":{"data":{"":"Project Background Every carbon fiber bicycle fork made by Trek undergoes a test known as the Fork Proof Load Test, where the fork is held at a standard load for 60 seconds, and the permanent deflection of the fork is measured. Forks with a permanent deflection above a certain value must be scrapped. The overall rate of scrapped forks is extremely low. The test is a more stringent version of a test described in ISO 4210.\nThese machines are in a production environment, not a Test Lab. Accordingly they have different sealing requirements, heat and humidity tolerance requirements, and general toughness requirements compared to a machine that may go in a Test Lab.\nIn 2020 a customer placed an order for a Fork Proof Load machine with 4 test stations. All previous models of Fork Proof Load machine had been designed as 2 station machines, where each station was completely indepedent from the others. The standalone nature of the stations made certain maintenance, troubleshooting, and data collection efforts more difficult, so the Test Department decided to create a 4 station machine. This was my first major project at Trek and I was responsible for the mechanical component design and mechanical assembly design. I performed project management for the design and purchase of all mechanical parts as well as collaboration and coordination with the electrical and controls engineers on the project.\nFinal Deliverables The machine was delivered to the customer in Q2 2021, roughly six months after the project began. The machine facilitated the accurate testing of tens of thousands of carbon fiber forks. The design was iterated upon in Fork Proof Load Electrical Redesign (2023-2024) and Fork Proof Load Control System Redesign (2025)\nProject Features","final-deliverables#Final Deliverables":"","new-welded-frame-design#New Welded Frame Design":"A ground up redesign of the framework was performed to accomodate 4 stations. Numerous other improvements were made regarding ease of assembly of the machine and subassemblies, interference issues with edge case forks, internal electrical cable routing, implementation of safety guarding, and more.","project-background#Project Background":"","project-features#Project Features":"","redefined-tolerances-on-mechanical-drawings#Redefined Tolerances on Mechanical Drawings":"A full tolerance stack-up was performed for the welded frame and all subassemblies for the first time in the Test Department, leading to seamless assembly and reduced fabrication and machining costs.","redesigned-clamp-mechanism#Redesigned Clamp Mechanism":"The previous design of the clamp was very sensitive to assembly and alignment of the components. Deficient clamp setup could result in inadequate clamping force on the steer tube of the fork. The clamp was redesigned around a rotational clevis for the wedge-cam-roller interface, guaranteeing function of the assembly independent of component alignment.","redesigned-load-cylinder-mechanism#Redesigned Load Cylinder Mechanism":"The previous design of the load cylinder mechanism and mounting plate was not height adjustable and the round cylinder shaft allowed rotation of the shaft, leading to wound-up load cables. A square shaft cylinder was implemented as well as an easily adjustable height setting."},"title":"Fork Proof Load Mechanical Redesign (2021)"}}